## Introduction to pandas(All about series)

In [1]:
import numpy as np
import pandas as pd

In [2]:
alphabet= ['a','b','c']
my_list = [10,20,30]
array = np.array([10,20,30])
dict = {'a':10,'b':20,'c':30}

In [3]:
pd.Series(data=my_list)

0    10
1    20
2    30
dtype: int64

In [4]:
pd.Series(data=my_list,index=alphabet)

a    10
b    20
c    30
dtype: int64

In [5]:
pd.Series(my_list,alphabet)

a    10
b    20
c    30
dtype: int64

In [6]:
pd.Series(array)

0    10
1    20
2    30
dtype: int32

In [7]:
pd.Series(array,alphabet)

a    10
b    20
c    30
dtype: int32

In [8]:
pd.Series(dict)

a    10
b    20
c    30
dtype: int64

In [9]:
pd.Series(data=alphabet)

0    a
1    b
2    c
dtype: object

In [10]:
series1 = pd.Series([1,2,3,4],index = ['sharuk', 'ashiq','noor', 'phani'])

In [11]:
series1

sharuk    1
ashiq     2
noor      3
phani     4
dtype: int64

In [12]:
series2 = pd.Series([2,4,6,8],index = ['sharuk', 'ashiq','noor', 'fasahat'])

In [13]:
series2

sharuk     2
ashiq      4
noor       6
fasahat    8
dtype: int64

In [14]:
series1['phani']
series1['sharuk']

1

In [15]:
series1 + series2

ashiq      6.0
fasahat    NaN
noor       9.0
phani      NaN
sharuk     3.0
dtype: float64

## DATAFRAMES

In [16]:
from numpy.random import randn
np.random.seed(101)

In [17]:
df = pd.DataFrame(randn(5,4),index='sharuk srk pathan khan sharukkhan'.split(),columns='math awp dc mpmc'.split())

In [18]:
df

                math       awp        dc      mpmc
sharuk      2.706850  0.628133  0.907969  0.503826
srk         0.651118 -0.319318 -0.848077  0.605965
pathan     -2.018168  0.740122  0.528813 -0.589001
khan        0.188695 -0.758872 -0.933237  0.955057
sharukkhan  0.190794  1.978757  2.605967  0.683509

In [19]:
df['math']

sharuk        2.706850
srk           0.651118
pathan       -2.018168
khan          0.188695
sharukkhan    0.190794
Name: math, dtype: float64

In [20]:
df[['awp','dc']]

                 awp        dc
sharuk      0.628133  0.907969
srk        -0.319318 -0.848077
pathan      0.740122  0.528813
khan       -0.758872 -0.933237
sharukkhan  1.978757  2.605967

In [21]:
df.dc

sharuk        0.907969
srk          -0.848077
pathan        0.528813
khan         -0.933237
sharukkhan    2.605967
Name: dc, dtype: float64

In [22]:
type(df['awp'])

pandas.core.series.Series

In [23]:
df['sat']=df['awp']+df['mpmc']

In [24]:
df

                math       awp        dc      mpmc       sat
sharuk      2.706850  0.628133  0.907969  0.503826  1.131958
srk         0.651118 -0.319318 -0.848077  0.605965  0.286647
pathan     -2.018168  0.740122  0.528813 -0.589001  0.151122
khan        0.188695 -0.758872 -0.933237  0.955057  0.196184
sharukkhan  0.190794  1.978757  2.605967  0.683509  2.662266

In [25]:
df.drop('sat',axis=1)

                math       awp        dc      mpmc
sharuk      2.706850  0.628133  0.907969  0.503826
srk         0.651118 -0.319318 -0.848077  0.605965
pathan     -2.018168  0.740122  0.528813 -0.589001
khan        0.188695 -0.758872 -0.933237  0.955057
sharukkhan  0.190794  1.978757  2.605967  0.683509

In [26]:
df

                math       awp        dc      mpmc       sat
sharuk      2.706850  0.628133  0.907969  0.503826  1.131958
srk         0.651118 -0.319318 -0.848077  0.605965  0.286647
pathan     -2.018168  0.740122  0.528813 -0.589001  0.151122
khan        0.188695 -0.758872 -0.933237  0.955057  0.196184
sharukkhan  0.190794  1.978757  2.605967  0.683509  2.662266

In [27]:
df.drop('sat',axis=1,inplace=True)

In [28]:
df

                math       awp        dc      mpmc
sharuk      2.706850  0.628133  0.907969  0.503826
srk         0.651118 -0.319318 -0.848077  0.605965
pathan     -2.018168  0.740122  0.528813 -0.589001
khan        0.188695 -0.758872 -0.933237  0.955057
sharukkhan  0.190794  1.978757  2.605967  0.683509

In [29]:
df.drop('sharukkhan',axis=0)

            math       awp        dc      mpmc
sharuk  2.706850  0.628133  0.907969  0.503826
srk     0.651118 -0.319318 -0.848077  0.605965
pathan -2.018168  0.740122  0.528813 -0.589001
khan    0.188695 -0.758872 -0.933237  0.955057

In [30]:
df

                math       awp        dc      mpmc
sharuk      2.706850  0.628133  0.907969  0.503826
srk         0.651118 -0.319318 -0.848077  0.605965
pathan     -2.018168  0.740122  0.528813 -0.589001
khan        0.188695 -0.758872 -0.933237  0.955057
sharukkhan  0.190794  1.978757  2.605967  0.683509

## selecting rows

In [31]:
df.loc['khan']

math    0.188695
awp    -0.758872
dc     -0.933237
mpmc    0.955057
Name: khan, dtype: float64

In [32]:
df.loc['pathan']

math   -2.018168
awp     0.740122
dc      0.528813
mpmc   -0.589001
Name: pathan, dtype: float64

In [33]:
df.iloc[2]

math   -2.018168
awp     0.740122
dc      0.528813
mpmc   -0.589001
Name: pathan, dtype: float64

In [34]:
df.loc['khan','math']

0.18869530944922425

In [35]:
df.loc[['srk','khan'],['math','mpmc']]

          math      mpmc
srk   0.651118  0.605965
khan  0.188695  0.955057

In [36]:
df.iloc[1]

math    0.651118
awp    -0.319318
dc     -0.848077
mpmc    0.605965
Name: srk, dtype: float64

## conditional selection

In [248]:
df

                math       awp        dc      mpmc
sharuk      2.706850  0.628133  0.907969  0.503826
srk         0.651118 -0.319318 -0.848077  0.605965
pathan     -2.018168  0.740122  0.528813 -0.589001
khan        0.188695 -0.758872 -0.933237  0.955057
sharukkhan  0.190794  1.978757  2.605967  0.683509

In [249]:
df>0

             math    awp     dc   mpmc
sharuk       True   True   True   True
srk          True  False  False   True
pathan      False   True   True  False
khan         True  False  False   True
sharukkhan   True   True   True   True

In [250]:
df[df>0]

                math       awp        dc      mpmc
sharuk      2.706850  0.628133  0.907969  0.503826
srk         0.651118       NaN       NaN  0.605965
pathan           NaN  0.740122  0.528813       NaN
khan        0.188695       NaN       NaN  0.955057
sharukkhan  0.190794  1.978757  2.605967  0.683509

In [251]:
df[df['awp']>0]

                math       awp        dc      mpmc
sharuk      2.706850  0.628133  0.907969  0.503826
pathan     -2.018168  0.740122  0.528813 -0.589001
sharukkhan  0.190794  1.978757  2.605967  0.683509

In [252]:
df[df['math']>0]['awp']

sharuk        0.628133
srk          -0.319318
khan         -0.758872
sharukkhan    1.978757
Name: awp, dtype: float64

In [253]:
df[df['math']>0][['dc','mpmc']]

                  dc      mpmc
sharuk      0.907969  0.503826
srk        -0.848077  0.605965
khan       -0.933237  0.955057
sharukkhan  2.605967  0.683509

In [254]:
df[(df['math']>0) & (df['awp'] > 1)]

                math       awp        dc      mpmc
sharukkhan  0.190794  1.978757  2.605967  0.683509

In [255]:
df

                math       awp        dc      mpmc
sharuk      2.706850  0.628133  0.907969  0.503826
srk         0.651118 -0.319318 -0.848077  0.605965
pathan     -2.018168  0.740122  0.528813 -0.589001
khan        0.188695 -0.758872 -0.933237  0.955057
sharukkhan  0.190794  1.978757  2.605967  0.683509

In [256]:
df.reset_index()

        index      math       awp        dc      mpmc
0      sharuk  2.706850  0.628133  0.907969  0.503826
1         srk  0.651118 -0.319318 -0.848077  0.605965
2      pathan -2.018168  0.740122  0.528813 -0.589001
3        khan  0.188695 -0.758872 -0.933237  0.955057
4  sharukkhan  0.190794  1.978757  2.605967  0.683509

In [257]:
newcol = 'CANADA NYGERIA WASHINGTON ORTONA COLOMBIA'.split()

In [258]:
df['states']=newcol

In [259]:
df

                math       awp        dc      mpmc      states
sharuk      2.706850  0.628133  0.907969  0.503826      CANADA
srk         0.651118 -0.319318 -0.848077  0.605965     NYGERIA
pathan     -2.018168  0.740122  0.528813 -0.589001  WASHINGTON
khan        0.188695 -0.758872 -0.933237  0.955057      ORTONA
sharukkhan  0.190794  1.978757  2.605967  0.683509    COLOMBIA

In [260]:
df.set_index('states')

                math       awp        dc      mpmc
states
CANADA      2.706850  0.628133  0.907969  0.503826
NYGERIA     0.651118 -0.319318 -0.848077  0.605965
WASHINGTON -2.018168  0.740122  0.528813 -0.589001
ORTONA      0.188695 -0.758872 -0.933237  0.955057
COLOMBIA    0.190794  1.978757  2.605967  0.683509

In [261]:
df

                math       awp        dc      mpmc      states
sharuk      2.706850  0.628133  0.907969  0.503826      CANADA
srk         0.651118 -0.319318 -0.848077  0.605965     NYGERIA
pathan     -2.018168  0.740122  0.528813 -0.589001  WASHINGTON
khan        0.188695 -0.758872 -0.933237  0.955057      ORTONA
sharukkhan  0.190794  1.978757  2.605967  0.683509    COLOMBIA

In [262]:
df.set_index('states',inplace=True)

In [263]:
df

                math       awp        dc      mpmc
states
CANADA      2.706850  0.628133  0.907969  0.503826
NYGERIA     0.651118 -0.319318 -0.848077  0.605965
WASHINGTON -2.018168  0.740122  0.528813 -0.589001
ORTONA      0.188695 -0.758872 -0.933237  0.955057
COLOMBIA    0.190794  1.978757  2.605967  0.683509

In [264]:
df

                math       awp        dc      mpmc
states
CANADA      2.706850  0.628133  0.907969  0.503826
NYGERIA     0.651118 -0.319318 -0.848077  0.605965
WASHINGTON -2.018168  0.740122  0.528813 -0.589001
ORTONA      0.188695 -0.758872 -0.933237  0.955057
COLOMBIA    0.190794  1.978757  2.605967  0.683509

## MISSING VALUES

In [265]:
df = pd.DataFrame({'A':[1,2,np.nan],
                  'B':[5,np.nan,np.nan],
                  'C':[1,2,3]})

In [266]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [267]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [268]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [269]:
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [270]:
df.fillna(value='FILL VALUE')

            A           B  C
0           1           5  1
1           2  FILL VALUE  2
2  FILL VALUE  FILL VALUE  3

In [271]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

## GROUP BY

In [272]:
import pandas as pd
data = {'Company':['GOOGLE','GOOGLE','MSFT','MSFT','FB','FB'],
       'Person':['SRK','ASHIQ','NOOR','NASIR','FASAHAT','PHANI'],
       'Sales':[200,120,340,124,243,350]}

In [273]:
df = pd.DataFrame(data)

In [274]:
df

  Company   Person  Sales
0  GOOGLE      SRK    200
1  GOOGLE    ASHIQ    120
2    MSFT     NOOR    340
3    MSFT    NASIR    124
4      FB  FASAHAT    243
5      FB    PHANI    350

In [275]:
comp=df.groupby('Company')

In [276]:
comp.mean()

         Sales
Company
FB       296.5
GOOGLE   160.0
MSFT     232.0

In [277]:
df.groupby('Company').mean()

         Sales
Company
FB       296.5
GOOGLE   160.0
MSFT     232.0

In [278]:
comp.std()

              Sales
Company
FB        75.660426
GOOGLE    56.568542
MSFT     152.735065

In [279]:
comp.min()

          Person  Sales
Company
FB       FASAHAT    243
GOOGLE     ASHIQ    120
MSFT       NASIR    124

In [280]:
comp.max()

        Person  Sales
Company
FB       PHANI    350
GOOGLE     SRK    200
MSFT      NOOR    340

In [281]:
comp.count()

         Person  Sales
Company
FB            2      2
GOOGLE        2      2
MSFT          2      2

In [282]:
comp.describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOGLE    2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [283]:
comp.describe().transpose()

Company              FB      GOOGLE        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

In [284]:
comp.describe().transpose()['GOOGLE']

Sales  count      2.000000
       mean     160.000000
       std       56.568542
       min      120.000000
       25%      140.000000
       50%      160.000000
       75%      180.000000
       max      200.000000
Name: GOOGLE, dtype: float64

## Merging Joing and Concatenation

In [285]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])

In [286]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [287]:
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7])

In [288]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [289]:
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])

In [290]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

## concatenation

In [291]:
pd.concat([df1,df2,df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [292]:
pd.concat([df1,df2,df3],axis=1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

In [293]:
pd.concat([df1,df2,df3],axis=1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

In [294]:
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
   
right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})

In [295]:
left

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [296]:
right

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

In [297]:
pd.merge(left,right,how='inner',on='key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [298]:
left = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                        'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3']})
    
right = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                               'key2': ['K0', 'K0', 'K0', 'K0'],
                                  'C': ['C0', 'C1', 'C2', 'C3'],
                                  'D': ['D0', 'D1', 'D2', 'D3']})

In [299]:
left

  key1 key2   A   B
0   K0   K0  A0  B0
1   K0   K1  A1  B1
2   K1   K0  A2  B2
3   K2   K1  A3  B3

In [300]:
right

  key1 key2   C   D
0   K0   K0  C0  D0
1   K1   K0  C1  D1
2   K1   K0  C2  D2
3   K2   K0  C3  D3

In [301]:
pd.merge(left, right, on=['key1', 'key2'])

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

## joining

In [302]:
left = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2']) 

right = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                    'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])

In [303]:
left

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

In [304]:
right

     C   D
K0  C0  D0
K2  C2  D2
K3  C3  D3

## OPERATIONS

In [305]:
import pandas as pd
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [306]:
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [307]:
df['col2'].nunique()

3

In [308]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [309]:
newdf = df[(df['col1']>2) & (df['col2']==444)]

In [310]:
newdf

   col1  col2 col3
3     4   444  xyz

In [311]:
def times2(x):
    return x*2

In [312]:
df['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [313]:
df['col1'].sum()

10

In [314]:
del df['col1']

In [315]:
df

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [316]:
df.columns

Index(['col2', 'col3'], dtype='object')

In [317]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [318]:
df

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [319]:
df.sort_values(by='col2')

   col2 col3
0   444  abc
3   444  xyz
1   555  def
2   666  ghi

In [320]:
df.isnull()

    col2   col3
0  False  False
1  False  False
2  False  False
3  False  False

In [321]:
df.dropna()

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [322]:
import numpy as np

In [323]:
df = pd.DataFrame({'col1':[1,2,3,np.nan],
                   'col2':[np.nan,555,666,444],
                   'col3':['abc','def','ghi','xyz']})
df.head()

   col1   col2 col3
0   1.0    NaN  abc
1   2.0  555.0  def
2   3.0  666.0  ghi
3   NaN  444.0  xyz

In [324]:
df.fillna('FILL')

   col1  col2 col3
0     1  FILL  abc
1     2   555  def
2     3   666  ghi
3  FILL   444  xyz

In [325]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)

In [326]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [327]:
df.pivot_table(values='D',index=['A', 'B'],columns=['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN